Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/oscctrl.h
/* -------- OSCCTRL_DFLLMUL : (OSCCTRL Offset: 0x3C) (R/W 32) DFLL48M Multiplier -------- */
#define OSCCTRL_DFLLMUL_RESETVALUE            _UINT32_(0x00)                                       /*  (OSCCTRL_DFLLMUL) DFLL48M Multiplier  Reset Value */

#define OSCCTRL_DFLLMUL_MUL_Pos               _UINT32_(0)                                          /* (OSCCTRL_DFLLMUL) DFLL Multiply Factor Position */
#define OSCCTRL_DFLLMUL_MUL_Msk               (_UINT32_(0xFFFF) << OSCCTRL_DFLLMUL_MUL_Pos)        /* (OSCCTRL_DFLLMUL) DFLL Multiply Factor Mask */
#define OSCCTRL_DFLLMUL_MUL(value)            (OSCCTRL_DFLLMUL_MUL_Msk & (_UINT32_(value) << OSCCTRL_DFLLMUL_MUL_Pos)) /* Assigment of value for MUL in the OSCCTRL_DFLLMUL register */
#define OSCCTRL_DFLLMUL_STEP_Pos              _UINT32_(16)                                         /* (OSCCTRL_DFLLMUL) Tune Maximum Step Position */
#define OSCCTRL_DFLLMUL_STEP_Msk              (_UINT32_(0x7F) << OSCCTRL_DFLLMUL_STEP_Pos)         /* (OSCCTRL_DFLLMUL) Tune Maximum Step Mask */
#define OSCCTRL_DFLLMUL_STEP(value)           (OSCCTRL_DFLLMUL_STEP_Msk & (_UINT32_(value) << OSCCTRL_DFLLMUL_STEP_Pos)) /* Assigment of value for STEP in the OSCCTRL_DFLLMUL register */
#define OSCCTRL_DFLLMUL_Msk                   _UINT32_(0x007FFFFF)                                 /* (OSCCTRL_DFLLMUL) Register Mask  */


/* -------- OSCCTRL_PLL0CTRL : (OSCCTRL Offset: 0x40) (R/W 32) PLL Control -------- */
#define OSCCTRL_PLL0CTRL_RESETVALUE           _UINT32_(0x00)                                       /*  (OSCCTRL_PLL0CTRL) PLL Control  Reset Value */

#define OSCCTRL_PLL0CTRL_ENABLE_Pos           _UINT32_(1)                                          /* (OSCCTRL_PLL0CTRL) PLL Enable Position */
#define OSCCTRL_PLL0CTRL_ENABLE_Msk           (_UINT32_(0x1) << OSCCTRL_PLL0CTRL_ENABLE_Pos)       /* (OSCCTRL_PLL0CTRL) PLL Enable Mask */
#define OSCCTRL_PLL0CTRL_ENABLE(value)        (OSCCTRL_PLL0CTRL_ENABLE_Msk & (_UINT32_(value) << OSCCTRL_PLL0CTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the OSCCTRL_PLL0CTRL register */
#define OSCCTRL_PLL0CTRL_WRTLOCK_Pos          _UINT32_(2)                                          /* (OSCCTRL_PLL0CTRL) Write Lock Position */
#define OSCCTRL_PLL0CTRL_WRTLOCK_Msk          (_UINT32_(0x1) << OSCCTRL_PLL0CTRL_WRTLOCK_Pos)      /* (OSCCTRL_PLL0CTRL) Write Lock Mask */
#define OSCCTRL_PLL0CTRL_WRTLOCK(value)       (OSCCTRL_PLL0CTRL_WRTLOCK_Msk & (_UINT32_(value) << OSCCTRL_PLL0CTRL_WRTLOCK_Pos)) /* Assigment of value for WRTLOCK in the OSCCTRL_PLL0CTRL register */
#define OSCCTRL_PLL0CTRL_ONDEMAND_Pos         _UINT32_(7)                                          /* (OSCCTRL_PLL0CTRL) On Demand Control Position */
#define OSCCTRL_PLL0CTRL_ONDEMAND_Msk         (_UINT32_(0x1) << OSCCTRL_PLL0CTRL_ONDEMAND_Pos)     /* (OSCCTRL_PLL0CTRL) On Demand Control Mask */
#define OSCCTRL_PLL0CTRL_ONDEMAND(value)      (OSCCTRL_PLL0CTRL_ONDEMAND_Msk & (_UINT32_(value) << OSCCTRL_PLL0CTRL_ONDEMAND_Pos)) /* Assigment of value for ONDEMAND in the OSCCTRL_PLL0CTRL register */
#define OSCCTRL_PLL0CTRL_REFSEL_Pos           _UINT32_(8)                                          /* (OSCCTRL_PLL0CTRL) Reference selection Position */
#define OSCCTRL_PLL0CTRL_REFSEL_Msk           (_UINT32_(0x7) << OSCCTRL_PLL0CTRL_REFSEL_Pos)       /* (OSCCTRL_PLL0CTRL) Reference selection Mask */
#define OSCCTRL_PLL0CTRL_REFSEL(value)        (OSCCTRL_PLL0CTRL_REFSEL_Msk & (_UINT32_(value) << OSCCTRL_PLL0CTRL_REFSEL_Pos)) /* Assigment of value for REFSEL in the OSCCTRL_PLL0CTRL register */
#define   OSCCTRL_PLL0CTRL_REFSEL_GCLK_Val    _UINT32_(0x0)                                        /* (OSCCTRL_PLL0CTRL) Dedicated GCLK clock reference  */
#define   OSCCTRL_PLL0CTRL_REFSEL_XOSC_Val    _UINT32_(0x1)                                        /* (OSCCTRL_PLL0CTRL) XOSC clock reference  */
#define   OSCCTRL_PLL0CTRL_REFSEL_DFLL48M_Val _UINT32_(0x2)                                        /* (OSCCTRL_PLL0CTRL) DFLL48M clock reference  */
#define OSCCTRL_PLL0CTRL_REFSEL_GCLK          (OSCCTRL_PLL0CTRL_REFSEL_GCLK_Val << OSCCTRL_PLL0CTRL_REFSEL_Pos) /* (OSCCTRL_PLL0CTRL) Dedicated GCLK clock reference Position  */
#define OSCCTRL_PLL0CTRL_REFSEL_XOSC          (OSCCTRL_PLL0CTRL_REFSEL_XOSC_Val << OSCCTRL_PLL0CTRL_REFSEL_Pos) /* (OSCCTRL_PLL0CTRL) XOSC clock reference Position  */
#define OSCCTRL_PLL0CTRL_REFSEL_DFLL48M       (OSCCTRL_PLL0CTRL_REFSEL_DFLL48M_Val << OSCCTRL_PLL0CTRL_REFSEL_Pos) /* (OSCCTRL_PLL0CTRL) DFLL48M clock reference Position  */
#define OSCCTRL_PLL0CTRL_BWSEL_Pos            _UINT32_(11)                                         /* (OSCCTRL_PLL0CTRL) Bandwidth selection Position */
#define OSCCTRL_PLL0CTRL_BWSEL_Msk            (_UINT32_(0x7) << OSCCTRL_PLL0CTRL_BWSEL_Pos)        /* (OSCCTRL_PLL0CTRL) Bandwidth selection Mask */
#define OSCCTRL_PLL0CTRL_BWSEL(value)         (OSCCTRL_PLL0CTRL_BWSEL_Msk & (_UINT32_(value) << OSCCTRL_PLL0CTRL_BWSEL_Pos)) /* Assigment of value for BWSEL in the OSCCTRL_PLL0CTRL register */
#define   OSCCTRL_PLL0CTRL_BWSEL_BWSEL0_Val   _UINT32_(0x0)                                        /* (OSCCTRL_PLL0CTRL) TBD  */
#define   OSCCTRL_PLL0CTRL_BWSEL_BWSEL1_Val   _UINT32_(0x1)                                        /* (OSCCTRL_PLL0CTRL) TBD  */
#define   OSCCTRL_PLL0CTRL_BWSEL_BWSEL2_Val   _UINT32_(0x2)                                        /* (OSCCTRL_PLL0CTRL) TBD  */
#define   OSCCTRL_PLL0CTRL_BWSEL_BWSEL3_Val   _UINT32_(0x3)                                        /* (OSCCTRL_PLL0CTRL) TBD  */
#define   OSCCTRL_PLL0CTRL_BWSEL_BWSEL4_Val   _UINT32_(0x4)                                        /* (OSCCTRL_PLL0CTRL) TBD  */
#define   OSCCTRL_PLL0CTRL_BWSEL_BWSEL5_Val   _UINT32_(0x5)                                        /* (OSCCTRL_PLL0CTRL) TBD  */
#define   OSCCTRL_PLL0CTRL_BWSEL_BWSEL6_Val   _UINT32_(0x6)                                        /* (OSCCTRL_PLL0CTRL) TBD  */
#define   OSCCTRL_PLL0CTRL_BWSEL_BWSEL7_Val   _UINT32_(0x7)                                        /* (OSCCTRL_PLL0CTRL) TBD  */
#define OSCCTRL_PLL0CTRL_BWSEL_BWSEL0         (OSCCTRL_PLL0CTRL_BWSEL_BWSEL0_Val << OSCCTRL_PLL0CTRL_BWSEL_Pos) /* (OSCCTRL_PLL0CTRL) TBD Position  */
#define OSCCTRL_PLL0CTRL_BWSEL_BWSEL1         (OSCCTRL_PLL0CTRL_BWSEL_BWSEL1_Val << OSCCTRL_PLL0CTRL_BWSEL_Pos) /* (OSCCTRL_PLL0CTRL) TBD Position  */
#define OSCCTRL_PLL0CTRL_BWSEL_BWSEL2         (OSCCTRL_PLL0CTRL_BWSEL_BWSEL2_Val << OSCCTRL_PLL0CTRL_BWSEL_Pos) /* (OSCCTRL_PLL0CTRL) TBD Position  */
#define OSCCTRL_PLL0CTRL_BWSEL_BWSEL3         (OSCCTRL_PLL0CTRL_BWSEL_BWSEL3_Val << OSCCTRL_PLL0CTRL_BWSEL_Pos) /* (OSCCTRL_PLL0CTRL) TBD Position  */
#define OSCCTRL_PLL0CTRL_BWSEL_BWSEL4         (OSCCTRL_PLL0CTRL_BWSEL_BWSEL4_Val << OSCCTRL_PLL0CTRL_BWSEL_Pos) /* (OSCCTRL_PLL0CTRL) TBD Position  */
#define OSCCTRL_PLL0CTRL_BWSEL_BWSEL5         (OSCCTRL_PLL0CTRL_BWSEL_BWSEL5_Val << OSCCTRL_PLL0CTRL_BWSEL_Pos) /* (OSCCTRL_PLL0CTRL) TBD Position  */
#define OSCCTRL_PLL0CTRL_BWSEL_BWSEL6         (OSCCTRL_PLL0CTRL_BWSEL_BWSEL6_Val << OSCCTRL_PLL0CTRL_BWSEL_Pos) /* (OSCCTRL_PLL0CTRL) TBD Position  */
#define OSCCTRL_PLL0CTRL_BWSEL_BWSEL7         (OSCCTRL_PLL0CTRL_BWSEL_BWSEL7_Val << OSCCTRL_PLL0CTRL_BWSEL_Pos) /* (OSCCTRL_PLL0CTRL) TBD Position  */
#define OSCCTRL_PLL0CTRL_Msk                  _UINT32_(0x00003F86)                                 /* (OSCCTRL_PLL0CTRL) Register Mask  */


