Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/oscctrl.h
/* -------- OSCCTRL_PLL0FBDIV : (OSCCTRL Offset: 0x44) (R/W 32) PLL Feed-Back Divider -------- */
#define OSCCTRL_PLL0FBDIV_RESETVALUE          _UINT32_(0x00)                                       /*  (OSCCTRL_PLL0FBDIV) PLL Feed-Back Divider  Reset Value */

#define OSCCTRL_PLL0FBDIV_FBDIV_Pos           _UINT32_(0)                                          /* (OSCCTRL_PLL0FBDIV) PLL Feed-Back Divider Factor Position */
#define OSCCTRL_PLL0FBDIV_FBDIV_Msk           (_UINT32_(0x3FF) << OSCCTRL_PLL0FBDIV_FBDIV_Pos)     /* (OSCCTRL_PLL0FBDIV) PLL Feed-Back Divider Factor Mask */
#define OSCCTRL_PLL0FBDIV_FBDIV(value)        (OSCCTRL_PLL0FBDIV_FBDIV_Msk & (_UINT32_(value) << OSCCTRL_PLL0FBDIV_FBDIV_Pos)) /* Assigment of value for FBDIV in the OSCCTRL_PLL0FBDIV register */
#define OSCCTRL_PLL0FBDIV_Msk                 _UINT32_(0x000003FF)                                 /* (OSCCTRL_PLL0FBDIV) Register Mask  */


/* -------- OSCCTRL_PLL0REFDIV : (OSCCTRL Offset: 0x48) (R/W 32) PLL reference divider -------- */
#define OSCCTRL_PLL0REFDIV_RESETVALUE         _UINT32_(0x00)                                       /*  (OSCCTRL_PLL0REFDIV) PLL reference divider  Reset Value */

#define OSCCTRL_PLL0REFDIV_REFDIV_Pos         _UINT32_(0)                                          /* (OSCCTRL_PLL0REFDIV) PLL reference division factor Position */
#define OSCCTRL_PLL0REFDIV_REFDIV_Msk         (_UINT32_(0x3F) << OSCCTRL_PLL0REFDIV_REFDIV_Pos)    /* (OSCCTRL_PLL0REFDIV) PLL reference division factor Mask */
#define OSCCTRL_PLL0REFDIV_REFDIV(value)      (OSCCTRL_PLL0REFDIV_REFDIV_Msk & (_UINT32_(value) << OSCCTRL_PLL0REFDIV_REFDIV_Pos)) /* Assigment of value for REFDIV in the OSCCTRL_PLL0REFDIV register */
#define OSCCTRL_PLL0REFDIV_Msk                _UINT32_(0x0000003F)                                 /* (OSCCTRL_PLL0REFDIV) Register Mask  */


/* -------- OSCCTRL_PLL0POSTDIVA : (OSCCTRL Offset: 0x4C) (R/W 32) PLL output clock divider A -------- */
#define OSCCTRL_PLL0POSTDIVA_RESETVALUE       _UINT32_(0x20202020)                                 /*  (OSCCTRL_PLL0POSTDIVA) PLL output clock divider A  Reset Value */

#define OSCCTRL_PLL0POSTDIVA_POSTDIV0_Pos     _UINT32_(0)                                          /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 clock division factor Position */
#define OSCCTRL_PLL0POSTDIVA_POSTDIV0_Msk     (_UINT32_(0x3F) << OSCCTRL_PLL0POSTDIVA_POSTDIV0_Pos) /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 clock division factor Mask */
#define OSCCTRL_PLL0POSTDIVA_POSTDIV0(value)  (OSCCTRL_PLL0POSTDIVA_POSTDIV0_Msk & (_UINT32_(value) << OSCCTRL_PLL0POSTDIVA_POSTDIV0_Pos)) /* Assigment of value for POSTDIV0 in the OSCCTRL_PLL0POSTDIVA register */
#define OSCCTRL_PLL0POSTDIVA_OUTEN0_Pos       _UINT32_(7)                                          /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 enable Position */
#define OSCCTRL_PLL0POSTDIVA_OUTEN0_Msk       (_UINT32_(0x1) << OSCCTRL_PLL0POSTDIVA_OUTEN0_Pos)   /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 enable Mask */
#define OSCCTRL_PLL0POSTDIVA_OUTEN0(value)    (OSCCTRL_PLL0POSTDIVA_OUTEN0_Msk & (_UINT32_(value) << OSCCTRL_PLL0POSTDIVA_OUTEN0_Pos)) /* Assigment of value for OUTEN0 in the OSCCTRL_PLL0POSTDIVA register */
#define OSCCTRL_PLL0POSTDIVA_POSTDIV1_Pos     _UINT32_(8)                                          /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 clock division factor Position */
#define OSCCTRL_PLL0POSTDIVA_POSTDIV1_Msk     (_UINT32_(0x3F) << OSCCTRL_PLL0POSTDIVA_POSTDIV1_Pos) /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 clock division factor Mask */
#define OSCCTRL_PLL0POSTDIVA_POSTDIV1(value)  (OSCCTRL_PLL0POSTDIVA_POSTDIV1_Msk & (_UINT32_(value) << OSCCTRL_PLL0POSTDIVA_POSTDIV1_Pos)) /* Assigment of value for POSTDIV1 in the OSCCTRL_PLL0POSTDIVA register */
#define OSCCTRL_PLL0POSTDIVA_OUTEN1_Pos       _UINT32_(15)                                         /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 enable Position */
#define OSCCTRL_PLL0POSTDIVA_OUTEN1_Msk       (_UINT32_(0x1) << OSCCTRL_PLL0POSTDIVA_OUTEN1_Pos)   /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 enable Mask */
#define OSCCTRL_PLL0POSTDIVA_OUTEN1(value)    (OSCCTRL_PLL0POSTDIVA_OUTEN1_Msk & (_UINT32_(value) << OSCCTRL_PLL0POSTDIVA_OUTEN1_Pos)) /* Assigment of value for OUTEN1 in the OSCCTRL_PLL0POSTDIVA register */
#define OSCCTRL_PLL0POSTDIVA_POSTDIV2_Pos     _UINT32_(16)                                         /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 clock division factor Position */
#define OSCCTRL_PLL0POSTDIVA_POSTDIV2_Msk     (_UINT32_(0x3F) << OSCCTRL_PLL0POSTDIVA_POSTDIV2_Pos) /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 clock division factor Mask */
#define OSCCTRL_PLL0POSTDIVA_POSTDIV2(value)  (OSCCTRL_PLL0POSTDIVA_POSTDIV2_Msk & (_UINT32_(value) << OSCCTRL_PLL0POSTDIVA_POSTDIV2_Pos)) /* Assigment of value for POSTDIV2 in the OSCCTRL_PLL0POSTDIVA register */
#define OSCCTRL_PLL0POSTDIVA_OUTEN2_Pos       _UINT32_(23)                                         /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 enable Position */
#define OSCCTRL_PLL0POSTDIVA_OUTEN2_Msk       (_UINT32_(0x1) << OSCCTRL_PLL0POSTDIVA_OUTEN2_Pos)   /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 enable Mask */
#define OSCCTRL_PLL0POSTDIVA_OUTEN2(value)    (OSCCTRL_PLL0POSTDIVA_OUTEN2_Msk & (_UINT32_(value) << OSCCTRL_PLL0POSTDIVA_OUTEN2_Pos)) /* Assigment of value for OUTEN2 in the OSCCTRL_PLL0POSTDIVA register */
#define OSCCTRL_PLL0POSTDIVA_POSTDIV3_Pos     _UINT32_(24)                                         /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 clock division factor Position */
#define OSCCTRL_PLL0POSTDIVA_POSTDIV3_Msk     (_UINT32_(0x3F) << OSCCTRL_PLL0POSTDIVA_POSTDIV3_Pos) /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 clock division factor Mask */
#define OSCCTRL_PLL0POSTDIVA_POSTDIV3(value)  (OSCCTRL_PLL0POSTDIVA_POSTDIV3_Msk & (_UINT32_(value) << OSCCTRL_PLL0POSTDIVA_POSTDIV3_Pos)) /* Assigment of value for POSTDIV3 in the OSCCTRL_PLL0POSTDIVA register */
#define OSCCTRL_PLL0POSTDIVA_OUTEN3_Pos       _UINT32_(31)                                         /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 enable Position */
#define OSCCTRL_PLL0POSTDIVA_OUTEN3_Msk       (_UINT32_(0x1) << OSCCTRL_PLL0POSTDIVA_OUTEN3_Pos)   /* (OSCCTRL_PLL0POSTDIVA) PLL output 0 enable Mask */
#define OSCCTRL_PLL0POSTDIVA_OUTEN3(value)    (OSCCTRL_PLL0POSTDIVA_OUTEN3_Msk & (_UINT32_(value) << OSCCTRL_PLL0POSTDIVA_OUTEN3_Pos)) /* Assigment of value for OUTEN3 in the OSCCTRL_PLL0POSTDIVA register */
#define OSCCTRL_PLL0POSTDIVA_Msk              _UINT32_(0xBFBFBFBF)                                 /* (OSCCTRL_PLL0POSTDIVA) Register Mask  */


/* -------- OSCCTRL_PLL1CTRL : (OSCCTRL Offset: 0x54) (R/W 32) PLL Control -------- */
#define OSCCTRL_PLL1CTRL_RESETVALUE           _UINT32_(0x00)                                       /*  (OSCCTRL_PLL1CTRL) PLL Control  Reset Value */

#define OSCCTRL_PLL1CTRL_ENABLE_Pos           _UINT32_(1)                                          /* (OSCCTRL_PLL1CTRL) PLL Enable Position */
#define OSCCTRL_PLL1CTRL_ENABLE_Msk           (_UINT32_(0x1) << OSCCTRL_PLL1CTRL_ENABLE_Pos)       /* (OSCCTRL_PLL1CTRL) PLL Enable Mask */
#define OSCCTRL_PLL1CTRL_ENABLE(value)        (OSCCTRL_PLL1CTRL_ENABLE_Msk & (_UINT32_(value) << OSCCTRL_PLL1CTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the OSCCTRL_PLL1CTRL register */
#define OSCCTRL_PLL1CTRL_WRTLOCK_Pos          _UINT32_(2)                                          /* (OSCCTRL_PLL1CTRL) Write Lock Position */
#define OSCCTRL_PLL1CTRL_WRTLOCK_Msk          (_UINT32_(0x1) << OSCCTRL_PLL1CTRL_WRTLOCK_Pos)      /* (OSCCTRL_PLL1CTRL) Write Lock Mask */
#define OSCCTRL_PLL1CTRL_WRTLOCK(value)       (OSCCTRL_PLL1CTRL_WRTLOCK_Msk & (_UINT32_(value) << OSCCTRL_PLL1CTRL_WRTLOCK_Pos)) /* Assigment of value for WRTLOCK in the OSCCTRL_PLL1CTRL register */
#define OSCCTRL_PLL1CTRL_ONDEMAND_Pos         _UINT32_(7)                                          /* (OSCCTRL_PLL1CTRL) On Demand Control Position */
#define OSCCTRL_PLL1CTRL_ONDEMAND_Msk         (_UINT32_(0x1) << OSCCTRL_PLL1CTRL_ONDEMAND_Pos)     /* (OSCCTRL_PLL1CTRL) On Demand Control Mask */
#define OSCCTRL_PLL1CTRL_ONDEMAND(value)      (OSCCTRL_PLL1CTRL_ONDEMAND_Msk & (_UINT32_(value) << OSCCTRL_PLL1CTRL_ONDEMAND_Pos)) /* Assigment of value for ONDEMAND in the OSCCTRL_PLL1CTRL register */
#define OSCCTRL_PLL1CTRL_REFSEL_Pos           _UINT32_(8)                                          /* (OSCCTRL_PLL1CTRL) Reference selection Position */
#define OSCCTRL_PLL1CTRL_REFSEL_Msk           (_UINT32_(0x7) << OSCCTRL_PLL1CTRL_REFSEL_Pos)       /* (OSCCTRL_PLL1CTRL) Reference selection Mask */
#define OSCCTRL_PLL1CTRL_REFSEL(value)        (OSCCTRL_PLL1CTRL_REFSEL_Msk & (_UINT32_(value) << OSCCTRL_PLL1CTRL_REFSEL_Pos)) /* Assigment of value for REFSEL in the OSCCTRL_PLL1CTRL register */
#define   OSCCTRL_PLL1CTRL_REFSEL_GCLK_Val    _UINT32_(0x0)                                        /* (OSCCTRL_PLL1CTRL) Dedicated GCLK clock reference  */
#define   OSCCTRL_PLL1CTRL_REFSEL_XOSC_Val    _UINT32_(0x1)                                        /* (OSCCTRL_PLL1CTRL) XOSC clock reference  */
#define   OSCCTRL_PLL1CTRL_REFSEL_DFLL48M_Val _UINT32_(0x2)                                        /* (OSCCTRL_PLL1CTRL) DFLL48M clock reference  */
#define OSCCTRL_PLL1CTRL_REFSEL_GCLK          (OSCCTRL_PLL1CTRL_REFSEL_GCLK_Val << OSCCTRL_PLL1CTRL_REFSEL_Pos) /* (OSCCTRL_PLL1CTRL) Dedicated GCLK clock reference Position  */
#define OSCCTRL_PLL1CTRL_REFSEL_XOSC          (OSCCTRL_PLL1CTRL_REFSEL_XOSC_Val << OSCCTRL_PLL1CTRL_REFSEL_Pos) /* (OSCCTRL_PLL1CTRL) XOSC clock reference Position  */
#define OSCCTRL_PLL1CTRL_REFSEL_DFLL48M       (OSCCTRL_PLL1CTRL_REFSEL_DFLL48M_Val << OSCCTRL_PLL1CTRL_REFSEL_Pos) /* (OSCCTRL_PLL1CTRL) DFLL48M clock reference Position  */
#define OSCCTRL_PLL1CTRL_BWSEL_Pos            _UINT32_(11)                                         /* (OSCCTRL_PLL1CTRL) Bandwidth selection Position */
#define OSCCTRL_PLL1CTRL_BWSEL_Msk            (_UINT32_(0x7) << OSCCTRL_PLL1CTRL_BWSEL_Pos)        /* (OSCCTRL_PLL1CTRL) Bandwidth selection Mask */
#define OSCCTRL_PLL1CTRL_BWSEL(value)         (OSCCTRL_PLL1CTRL_BWSEL_Msk & (_UINT32_(value) << OSCCTRL_PLL1CTRL_BWSEL_Pos)) /* Assigment of value for BWSEL in the OSCCTRL_PLL1CTRL register */
#define   OSCCTRL_PLL1CTRL_BWSEL_BWSEL0_Val   _UINT32_(0x0)                                        /* (OSCCTRL_PLL1CTRL) TBD  */
#define   OSCCTRL_PLL1CTRL_BWSEL_BWSEL1_Val   _UINT32_(0x1)                                        /* (OSCCTRL_PLL1CTRL) TBD  */
#define   OSCCTRL_PLL1CTRL_BWSEL_BWSEL2_Val   _UINT32_(0x2)                                        /* (OSCCTRL_PLL1CTRL) TBD  */
#define   OSCCTRL_PLL1CTRL_BWSEL_BWSEL3_Val   _UINT32_(0x3)                                        /* (OSCCTRL_PLL1CTRL) TBD  */
#define   OSCCTRL_PLL1CTRL_BWSEL_BWSEL4_Val   _UINT32_(0x4)                                        /* (OSCCTRL_PLL1CTRL) TBD  */
#define   OSCCTRL_PLL1CTRL_BWSEL_BWSEL5_Val   _UINT32_(0x5)                                        /* (OSCCTRL_PLL1CTRL) TBD  */
#define   OSCCTRL_PLL1CTRL_BWSEL_BWSEL6_Val   _UINT32_(0x6)                                        /* (OSCCTRL_PLL1CTRL) TBD  */
#define   OSCCTRL_PLL1CTRL_BWSEL_BWSEL7_Val   _UINT32_(0x7)                                        /* (OSCCTRL_PLL1CTRL) TBD  */
#define OSCCTRL_PLL1CTRL_BWSEL_BWSEL0         (OSCCTRL_PLL1CTRL_BWSEL_BWSEL0_Val << OSCCTRL_PLL1CTRL_BWSEL_Pos) /* (OSCCTRL_PLL1CTRL) TBD Position  */
#define OSCCTRL_PLL1CTRL_BWSEL_BWSEL1         (OSCCTRL_PLL1CTRL_BWSEL_BWSEL1_Val << OSCCTRL_PLL1CTRL_BWSEL_Pos) /* (OSCCTRL_PLL1CTRL) TBD Position  */
#define OSCCTRL_PLL1CTRL_BWSEL_BWSEL2         (OSCCTRL_PLL1CTRL_BWSEL_BWSEL2_Val << OSCCTRL_PLL1CTRL_BWSEL_Pos) /* (OSCCTRL_PLL1CTRL) TBD Position  */
#define OSCCTRL_PLL1CTRL_BWSEL_BWSEL3         (OSCCTRL_PLL1CTRL_BWSEL_BWSEL3_Val << OSCCTRL_PLL1CTRL_BWSEL_Pos) /* (OSCCTRL_PLL1CTRL) TBD Position  */
#define OSCCTRL_PLL1CTRL_BWSEL_BWSEL4         (OSCCTRL_PLL1CTRL_BWSEL_BWSEL4_Val << OSCCTRL_PLL1CTRL_BWSEL_Pos) /* (OSCCTRL_PLL1CTRL) TBD Position  */
#define OSCCTRL_PLL1CTRL_BWSEL_BWSEL5         (OSCCTRL_PLL1CTRL_BWSEL_BWSEL5_Val << OSCCTRL_PLL1CTRL_BWSEL_Pos) /* (OSCCTRL_PLL1CTRL) TBD Position  */
#define OSCCTRL_PLL1CTRL_BWSEL_BWSEL6         (OSCCTRL_PLL1CTRL_BWSEL_BWSEL6_Val << OSCCTRL_PLL1CTRL_BWSEL_Pos) /* (OSCCTRL_PLL1CTRL) TBD Position  */
#define OSCCTRL_PLL1CTRL_BWSEL_BWSEL7         (OSCCTRL_PLL1CTRL_BWSEL_BWSEL7_Val << OSCCTRL_PLL1CTRL_BWSEL_Pos) /* (OSCCTRL_PLL1CTRL) TBD Position  */
#define OSCCTRL_PLL1CTRL_Msk                  _UINT32_(0x00003F86)                                 /* (OSCCTRL_PLL1CTRL) Register Mask  */


