Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca90_cult/pic32cz_ca90_tcm_performance/firmware/src/packs/PIC32CZ8110CA90208_DFP/component/oscctrl.h
#define OSCCTRL_RC48MCAL0_CAL_Pos             _UINT32_(0)                                          /* (OSCCTRL_RC48MCAL0) RC48M Calibration Position */
#define OSCCTRL_RC48MCAL0_CAL_Msk             (_UINT32_(0xFFFFFFFF) << OSCCTRL_RC48MCAL0_CAL_Pos)  /* (OSCCTRL_RC48MCAL0) RC48M Calibration Mask */
#define OSCCTRL_RC48MCAL0_CAL(value)          (OSCCTRL_RC48MCAL0_CAL_Msk & (_UINT32_(value) << OSCCTRL_RC48MCAL0_CAL_Pos)) /* Assigment of value for CAL in the OSCCTRL_RC48MCAL0 register */
#define OSCCTRL_RC48MCAL0_Msk                 _UINT32_(0xFFFFFFFF)                                 /* (OSCCTRL_RC48MCAL0) Register Mask  */

/* FUSES_OSC_RC48MHZ_V1 mode */
#define OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_temp_trim_mv_Pos _UINT32_(0)                                          /* (OSCCTRL_RC48MCAL0) Temp trim value Position */
#define OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_temp_trim_mv_Msk (_UINT32_(0x3F) << OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_temp_trim_mv_Pos) /* (OSCCTRL_RC48MCAL0) Temp trim value Mask */
#define OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_temp_trim_mv(value) (OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_temp_trim_mv_Msk & (_UINT32_(value) << OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_temp_trim_mv_Pos))
#define OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_proc_trim_mv_Pos _UINT32_(6)                                          /* (OSCCTRL_RC48MCAL0) Proc trim value Position */
#define OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_proc_trim_mv_Msk (_UINT32_(0xFF) << OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_proc_trim_mv_Pos) /* (OSCCTRL_RC48MCAL0) Proc trim value Mask */
#define OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_proc_trim_mv(value) (OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_proc_trim_mv_Msk & (_UINT32_(value) << OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_proc_trim_mv_Pos))
#define OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_iosc_boost_Pos _UINT32_(16)                                         /* (OSCCTRL_RC48MCAL0) IOSC boost Position */
#define OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_iosc_boost_Msk (_UINT32_(0x1) << OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_iosc_boost_Pos) /* (OSCCTRL_RC48MCAL0) IOSC boost Mask */
#define OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_iosc_boost(value) (OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_iosc_boost_Msk & (_UINT32_(value) << OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_iosc_boost_Pos))
#define OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_out_buf_sel_Pos _UINT32_(17)                                         /* (OSCCTRL_RC48MCAL0) Output buffer select Position */
#define OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_out_buf_sel_Msk (_UINT32_(0x1) << OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_out_buf_sel_Pos) /* (OSCCTRL_RC48MCAL0) Output buffer select Mask */
#define OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_out_buf_sel(value) (OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_out_buf_sel_Msk & (_UINT32_(value) << OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_out_buf_sel_Pos))
#define OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_ldo_vout_boost_Pos _UINT32_(18)                                         /* (OSCCTRL_RC48MCAL0) LDO VOUT boost Position */
#define OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_ldo_vout_boost_Msk (_UINT32_(0x1) << OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_ldo_vout_boost_Pos) /* (OSCCTRL_RC48MCAL0) LDO VOUT boost Mask */
#define OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_ldo_vout_boost(value) (OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_ldo_vout_boost_Msk & (_UINT32_(value) << OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_ldo_vout_boost_Pos))
#define OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_cmp_8m_lp_Pos _UINT32_(19)                                         /* (OSCCTRL_RC48MCAL0) Comparator 8MHz low-power Position */
#define OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_cmp_8m_lp_Msk (_UINT32_(0x1) << OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_cmp_8m_lp_Pos) /* (OSCCTRL_RC48MCAL0) Comparator 8MHz low-power Mask */
#define OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_cmp_8m_lp(value) (OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_cmp_8m_lp_Msk & (_UINT32_(value) << OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_cmp_8m_lp_Pos))
#define OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_cmp_pwr_ctrl_Pos _UINT32_(20)                                         /* (OSCCTRL_RC48MCAL0) Comparator power control Position */
#define OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_cmp_pwr_ctrl_Msk (_UINT32_(0x7) << OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_cmp_pwr_ctrl_Pos) /* (OSCCTRL_RC48MCAL0) Comparator power control Mask */
#define OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_cmp_pwr_ctrl(value) (OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_cmp_pwr_ctrl_Msk & (_UINT32_(value) << OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_cmp_pwr_ctrl_Pos))
#define OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1_Msk _UINT32_(0x007F3FFF)                                  /* (OSCCTRL_RC48MCAL0_FUSES_OSC_RC48MHZ_V1) Register Mask  */


/** \brief OSCCTRL register offsets definitions */
#define OSCCTRL_EVCTRL_REG_OFST        _UINT32_(0x00)      /* (OSCCTRL_EVCTRL) Event Control Offset */
#define OSCCTRL_INTENCLR_REG_OFST      _UINT32_(0x04)      /* (OSCCTRL_INTENCLR) Interrupt Enable Clear Offset */
#define OSCCTRL_INTENSET_REG_OFST      _UINT32_(0x08)      /* (OSCCTRL_INTENSET) Interrupt Enable Set Offset */
#define OSCCTRL_INTFLAG_REG_OFST       _UINT32_(0x0C)      /* (OSCCTRL_INTFLAG) Interrupt Flag Status and Clear Offset */
#define OSCCTRL_STATUS_REG_OFST        _UINT32_(0x10)      /* (OSCCTRL_STATUS) Status Offset */
#define OSCCTRL_XOSCCTRLA_REG_OFST     _UINT32_(0x14)      /* (OSCCTRL_XOSCCTRLA) External Multipurpose Crystal Oscillator Control A Offset */
#define OSCCTRL_XOSCCTRLB_REG_OFST     _UINT32_(0x18)      /* (OSCCTRL_XOSCCTRLB) External Multipurpose Crystal Oscillator Control B Offset */
#define OSCCTRL_DFLLCTRLA_REG_OFST     _UINT32_(0x2C)      /* (OSCCTRL_DFLLCTRLA) DFLL48M Control A Offset */
#define OSCCTRL_DFLLCTRLB_REG_OFST     _UINT32_(0x30)      /* (OSCCTRL_DFLLCTRLB) DFLL48M Control B Offset */
#define OSCCTRL_DFLLTUNE_REG_OFST      _UINT32_(0x34)      /* (OSCCTRL_DFLLTUNE) DFLL48M Tune Offset */
#define OSCCTRL_DFLLDIFF_REG_OFST      _UINT32_(0x38)      /* (OSCCTRL_DFLLDIFF) DFLL48M Diff Offset */
#define OSCCTRL_DFLLMUL_REG_OFST       _UINT32_(0x3C)      /* (OSCCTRL_DFLLMUL) DFLL48M Multiplier Offset */
#define OSCCTRL_PLL0CTRL_REG_OFST      _UINT32_(0x40)      /* (OSCCTRL_PLL0CTRL) PLL Control Offset */
#define OSCCTRL_PLL0FBDIV_REG_OFST     _UINT32_(0x44)      /* (OSCCTRL_PLL0FBDIV) PLL Feed-Back Divider Offset */
#define OSCCTRL_PLL0REFDIV_REG_OFST    _UINT32_(0x48)      /* (OSCCTRL_PLL0REFDIV) PLL reference divider Offset */
#define OSCCTRL_PLL0POSTDIVA_REG_OFST  _UINT32_(0x4C)      /* (OSCCTRL_PLL0POSTDIVA) PLL output clock divider A Offset */
#define OSCCTRL_PLL1CTRL_REG_OFST      _UINT32_(0x54)      /* (OSCCTRL_PLL1CTRL) PLL Control Offset */
#define OSCCTRL_PLL1FBDIV_REG_OFST     _UINT32_(0x58)      /* (OSCCTRL_PLL1FBDIV) PLL Feed-Back Divider Offset */
#define OSCCTRL_PLL1REFDIV_REG_OFST    _UINT32_(0x5C)      /* (OSCCTRL_PLL1REFDIV) PLL reference divider Offset */
#define OSCCTRL_PLL1POSTDIVA_REG_OFST  _UINT32_(0x60)      /* (OSCCTRL_PLL1POSTDIVA) PLL output clock divider A Offset */
#define OSCCTRL_FRACDIV0_REG_OFST      _UINT32_(0x6C)      /* (OSCCTRL_FRACDIV0) Fractional Divider Offset */
#define OSCCTRL_FRACDIV1_REG_OFST      _UINT32_(0x74)      /* (OSCCTRL_FRACDIV1) Fractional Divider Offset */
#define OSCCTRL_SYNCBUSY_REG_OFST      _UINT32_(0x78)      /* (OSCCTRL_SYNCBUSY) Synchronization Busy Offset */
#define OSCCTRL_XOSCCAL_REG_OFST       _UINT32_(0x80)      /* (OSCCTRL_XOSCCAL) XOSC Calibration Register Offset */
#define OSCCTRL_RC48MCAL0_REG_OFST     _UINT32_(0x88)      /* (OSCCTRL_RC48MCAL0) RC48M Calibration 0 Offset */

